{
	"No workspace folders are open. Please open a workspace folder to use this extension": "No hay carpetas de espacio de trabajo abiertas. Abra una carpeta de espacio de trabajo para usar esta extensión",
	"Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Selecciona una carpeta de espacio de trabajo para usar. Esta carpeta se utilizará para cargar la configuración específica del espacio de trabajo para la extensión",
	"{0} is now enabled and ready to use": "{0} ahora está habilitado y listo para usar",
	"{0} is now disabled": "{0} ahora está deshabilitado",
	"{0} is disabled in settings. Enable it to use its features": "{0} está deshabilitado en la configuración. Habilítelo para usar sus funciones",
	"Welcome to {0} version {1}! The extension is now active": "¡Bienvenido a {0} versión {1}! La extensión ahora está activa",
	"New version of {0} is available. Check out the release notes for version {1}": "Hay disponible una nueva versión de {0}. Consulte las notas de la versión {1}",
	"Release Notes": "Notas de la versión",
	"Dismiss": "Descartar",
	"Select a workspace folder to use. This folder will be used to generate the file": "Selecciona una carpeta de espacio de trabajo para usar. Esta carpeta se utilizará para generar el archivo",
	"The workspace folder does not exist. Please select a valid workspace folder to use": "La carpeta de espacio de trabajo no existe. Seleccione una carpeta de espacio de trabajo válida para usar",
	"Enter the folder name where the {0} will be created": "Ingrese el nombre de la carpeta donde se creará el {0}",
	"Enter the folder name, e.g. models, services, utils, etc.": "Ingrese el nombre de la carpeta, por ejemplo, models, services, utils, etc.",
	"The folder name is invalid! Please enter a valid folder name": "¡El nombre de la carpeta no es válido! Por favor, introduzca un nombre de carpeta válido",
	"Enter the {0} name": "Ingrese el nombre de {0}",
	"Enter the {0} name, e.g. user, product, order, etc.": "Ingrese el nombre de {0}, por ejemplo, user, product, order, etc.",
	"The {0} name is invalid! Please enter a valid name": "¡El nombre de {0} no es válido! Por favor, introduzca un nombre válido",
	"Enter the {0} type (optional)": "Ingrese el tipo de {0} (opcional)",
	"Enter the {0} type, e.g. model, service, util, etc.": "Ingrese el tipo de {0}, por ejemplo, model, service, util, etc.",
	"The {0} type is invalid! Please enter a valid type": "¡El tipo de {0} no es válido! Por favor, introduzca un tipo válido",
	"The custom components list is empty. Please add custom components to the configuration": "La lista de componentes personalizados está vacía. Agregue componentes personalizados a la configuración",
	"Select the template for the custom element generation": "Seleccione la plantilla para la generación del elemento personalizado",
	"Enter the file name for the custom component. The file extension will be added automatically": "Ingrese el nombre del archivo para el componente personalizado. La extensión del archivo se agregará automáticamente",
	"Enter the file name, e.g. User, Product, Order, etc.": "Ingrese el nombre del componente, por ejemplo, User, Product, Order, etc.",
	"The template for the {0} does not exist. Please try again": "La plantilla para el {0} no existe. Por favor, inténtelo de nuevo",
	"The template for the custom component does not exist. Please try again": "La plantilla para el componente personalizado no existe. Por favor, inténtelo de nuevo",
	"The file has not been created! Please try again": "¡El archivo no se ha creado! Por favor, inténtelo de nuevo",
	"The {0} has been created successfully": "El {0} se ha creado correctamente",
	"File created successfully!": "Archivo creado correctamente!",
	"The file name already exists! Please enter a different name": "El nombre del archivo ya existe! Por favor, introduzca un nombre diferente",
	"Operation cancelled!": "¡Operación cancelada!"
}
